---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DeletingOriginalWillDeleteParts
source: html/e383458b-cf0e-c5dc-4a4b-502de0cb56f8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DeletingOriginalWillDeleteParts Property

Deletion of this element will delete its associated Parts.

## Syntax (C#)
```csharp
public static FailureDefinitionId DeletingOriginalWillDeleteParts { get; }
```